#include "../../include/geometry/CubeData.h"

namespace Geometry::CubeData {

// У куба 24 вершины вместо 8, потому что каждая грань хранит свои UV
// и может независимо использовать текстуру.
const std::vector<Vertex> vertices = {
    // Передняя грань
    {-0.5f, -0.5f, 0.5f, 1.0f, 0.2f, 0.2f, 0.0f, 0.0f},
    {0.5f, -0.5f, 0.5f, 1.0f, 0.2f, 0.2f, 1.0f, 0.0f},
    {0.5f, 0.5f, 0.5f, 1.0f, 0.2f, 0.2f, 1.0f, 1.0f},
    {-0.5f, 0.5f, 0.5f, 1.0f, 0.2f, 0.2f, 0.0f, 1.0f},

    // Задняя грань
    {0.5f, -0.5f, -0.5f, 0.2f, 1.0f, 0.2f, 0.0f, 0.0f},
    {-0.5f, -0.5f, -0.5f, 0.2f, 1.0f, 0.2f, 1.0f, 0.0f},
    {-0.5f, 0.5f, -0.5f, 0.2f, 1.0f, 0.2f, 1.0f, 1.0f},
    {0.5f, 0.5f, -0.5f, 0.2f, 1.0f, 0.2f, 0.0f, 1.0f},

    // Левая грань
    {-0.5f, -0.5f, -0.5f, 0.2f, 0.2f, 1.0f, 0.0f, 0.0f},
    {-0.5f, -0.5f, 0.5f, 0.2f, 0.2f, 1.0f, 1.0f, 0.0f},
    {-0.5f, 0.5f, 0.5f, 0.2f, 0.2f, 1.0f, 1.0f, 1.0f},
    {-0.5f, 0.5f, -0.5f, 0.2f, 0.2f, 1.0f, 0.0f, 1.0f},

    // Правая грань
    {0.5f, -0.5f, 0.5f, 1.0f, 0.8f, 0.2f, 0.0f, 0.0f},
    {0.5f, -0.5f, -0.5f, 1.0f, 0.8f, 0.2f, 1.0f, 0.0f},
    {0.5f, 0.5f, -0.5f, 1.0f, 0.8f, 0.2f, 1.0f, 1.0f},
    {0.5f, 0.5f, 0.5f, 1.0f, 0.8f, 0.2f, 0.0f, 1.0f},

    // Верхняя грань
    {-0.5f, 0.5f, 0.5f, 0.2f, 1.0f, 1.0f, 0.0f, 0.0f},
    {0.5f, 0.5f, 0.5f, 0.2f, 1.0f, 1.0f, 1.0f, 0.0f},
    {0.5f, 0.5f, -0.5f, 0.2f, 1.0f, 1.0f, 1.0f, 1.0f},
    {-0.5f, 0.5f, -0.5f, 0.2f, 1.0f, 1.0f, 0.0f, 1.0f},

    // Нижняя грань
    {-0.5f, -0.5f, -0.5f, 1.0f, 0.2f, 1.0f, 0.0f, 0.0f},
    {0.5f, -0.5f, -0.5f, 1.0f, 0.2f, 1.0f, 1.0f, 0.0f},
    {0.5f, -0.5f, 0.5f, 1.0f, 0.2f, 1.0f, 1.0f, 1.0f},
    {-0.5f, -0.5f, 0.5f, 1.0f, 0.2f, 1.0f, 0.0f, 1.0f},
};

// На каждую из 6 граней приходится по 2 треугольника.
const std::vector<unsigned int> indices = {
    0,  1,  2,  0,  2,  3,  // Передняя грань
    4,  5,  6,  4,  6,  7,  // Задняя грань
    8,  9,  10, 8,  10, 11, // Левая грань
    12, 13, 14, 12, 14, 15, // Правая грань
    16, 17, 18, 16, 18, 19, // Верхняя грань
    20, 21, 22, 20, 22, 23  // Нижняя грань
};

} // namespace Geometry::CubeData
